start_text = """👋 Привет #full_name! Я бот NextGen Academy. Я здесь, чтобы помочь тебе с твоим обучением. 🤓

Наш бот позволяет связаться с менеджерами для получения бесплатной онлайн-консультации по выбору направления.

Для регистрации выберите пожалуйста свой язык 
"""

about_courses_text = f"""
*Наши курсы:*

 🔹 *Flutter*. Разработка приложений с использованием Flutter и Dart 📱
 🔹 *PYTHON*. "Основы Python и фреймворк Django" 🐍
 🔹 *PHP*. Создание веб-приложений с использованием PHP и Laravel 💻
 🔹 *DevOps*. Профессиональное владение DevOps и инженерией платформы ♾
 

Чтобы помочь вам выбрать подходящий курс, мы проводим бесплатные открытые уроки, где вы узнаете о программе обучения, познакомитесь с преподавателем и сможете записаться.😉

В нашем главном меню вы можете выбрать интересующий вас раздел ⬇️ :"""

python_course_text = '''
<b>Основы Python и фреймворк Django</b>

Курс представляет собой всесторонний курс, который предоставляет введение в фундаментальные концепции и техники программирования с использованием языка Python, а также подробное изучение популярного веб-фреймворка Django. 
На курсе вы научитесь создавать современные веб-приложения, desktop-приложений, работа с БД. 🐍

Всего за 7 месяцев обучения вы освоите все необходимые навыки для одной из самых востребованных профессий современности. 💪

Очное обучение за месяц: 1 800 000 сум

Программа курса PYTHON: 

◾️ Основы PYTHON. Изучение функционального программирования
◾  ООП - Объектно-ориентированная программирования;
◾️ Базы данных. Изучение основ языка структурированных запросов SQL;
◾️ Desktop-приложения с использованием БД и API;
◾️ Онлайн-магазины. Создание веб-приложений и онлайн-магазинов, используя фреймворк Django.
◾  Создание API на основе DRF (Django Rest Framework)

Перед запуском курса мы проводим бесплатные открытые уроки, где вы узнаете программу обучения, подробности о курсе, познакомитесь с преподавателем и сможете записаться. 😉'''

php_course_text = '''
На курсе ВЕБ ПРОГРАММИРОВАНИЕ вы изучите основные языки программирования, научитесь создавать современные сайты, познакомитесь с инструментами, которые используют успешные веб-разработчики. 💻

Всего за 10 месяцев вы освоите все необходимые навыки для полноценной профессии.

Очное обучение за месяц: 1 800 000 сум

Программа курса ВЕБ ПРОГРАММИРОВАНИЕ: 

◾️ Основы верстки веб-страниц (Visual studio, HTML и CSS);
◾️ Изучение графического онлайн-редактора Figma;
◾️ Грамотное структурирование кода - БЭМ, надежное хранение проектов и загрузка портфолио на облачные сервисы (GitHub, Heroku и др.) с помощью системы Git;
◾️ Полное погружение в самый гибкий язык программирования JavaScript; 
◾️ Изучение прогрессивного фреймворка Vue.js;
◾️ Vuex -  паттерн управления состоянием + библиотека для приложений на Vue.js;
◾️ SASS - препроцессор CSS, продвинутый тип написания CSS;  
◾️ Создание одностраничных приложений (SPA) с помощью Vue router;
◾️Изучение процесса программирования при создании приложений Api (Application Programming Interface);  
◾️Знакомство с облачной базой данных Firebase, которая позволяет пользователям хранить и получать сохраненную информацию, а также имеет удобные средства и методы взаимодействия с ней.

Перед запуском курса мы проводим бесплатные открытые уроки, где вы узнаете программу обучения, подробности о курсе, познакомитесь с преподавателем и сможете записаться. 😉'''

flutter_course_text = '''
На курсе ANDROID & iOS РАЗРАБОТКА вы научитесь разрабатывать приложения разной степени сложности, а также освоите работу с операционными системами Android, iOS и Windows.

Всего за 8 месяцев обучения вы познакомитесь с языком программирования Dart, изучите фреймворк Flutter, научитесь работать с API, а также узнаете, как разместить своё приложение в Play Market и App Store.

Очное обучение за месяц: 1 800 000 сум

Программа курса ANDROID & iOS РАЗРАБОТКА:

◾️ Основы языка программирования Dart;
◾️ Работа с базами данных (FireBase, SQLite);
◾️ Работа с компоновкой и макетами;
◾️ Изучение встроенных стилей: Cupertino (iOS), Material (Android) и Fluent (Windows);
◾️ Оформление портфолио.

Перед запуском курса мы проводим бесплатные открытые уроки, где вы узнаете программу обучения, подробности о курсе, познакомитесь с преподавателем и сможете записаться. 😉'''

about_nextgen_text = """
🔝<b>NextGen Academy</b> - первая международная IT академия в Узбекистане, открытая в рамках сотрудничества с Американским Международным Университетом в Бангладеш (AIUB), Институтом Непрерывного Образования (ICE) при AIUB и IT Парком Узбекистана в 2022 году. 

🤝NextGen Academy  является партнером международных вендоров как <b>Python institute</b>, <b>JS institute</b>, <b>Cisco Networking Academy</b>, <b>Fortinet</b>. Это партнерство позволяет студентам получить качественное обучение по международным программам, а также дает возможность для получения сертификатa международного образца.

🖊Наша академия посвящена передаче знаний, навыков и практического и международного опыта, необходимых для успешной карьеры в быстро развивающейся IT - индустрии. 

📉Мы стремимся сократить разрыв между требованиями промышленности и доступными кадрами, предоставляя  всеобъемлющие программы, отвечающие растущему спросу на квалифицированных IT - специалистов <b>в Узбекистане и мировом рынке</b>"""


contact_text = """
🏙 *Наш адрес:*
г. Ташкент, Муминова, 4\1, 100041. Здания Aloqabank , 16-этаж. Ориентир: Университет INHA


☎ *Контакты:*
Telegram: [nextgen_admin](https://t.me/kamilaa3)
Тел: +998 55-515-99-00
Email: nextgenacademyuzb@gmail.com

📍 *Локация:* 
[Yandex](https://yandex.com/maps/-/CDUpMN~f) | [Google Maps](https://maps.app.goo.gl/QxA81NH4D5UDnGMTA)

*Наши социальные сети:*
[Website](https://nextgen.uz/) | [Telegram](https://t.me/nextgenacademyuz) | [Facebook](https://www.facebook.com/profile.php?id=100090080721603) | [Instagram](https://www.instagram.com/ngen.uz/)
"""


confirm_ol_python_text = """
Вы хотите записаться на открытый урок:
Курс: PYTHON

📆 Дата: 14.10.2023
🕰 Время: 17:00
🇺🇿 Язык: Узбекский
Формат: оффлайн 

Нажмите кнопку “Подтвердить” и в скором времени с вами свяжутся наши менджеры."""

confirm_ol_php_text = """
Вы хотите записаться на открытый урок:
Курс: Php

📆 Дата: 28.10.2023
🕰 Время: 
🇺🇿 Язык: Узбекский
Формат: оффлайн 

Нажмите кнопку “Подтвердить” и в скором времени с вами свяжутся наши менджеры."""

confirm_ol_flutter_text = """
Вы хотите записаться на открытый урок:
Курс: Flutter

📆 Дата: 28.10.2023
🕰 Время: 
🇺🇿 Язык: Узбекский
Формат: оффлайн 

Нажмите кнопку “Подтвердить” и в скором времени с вами свяжутся наши менджеры."""

after_register_text = """Ожидайте, наш менеджер свяжется с вами в ближайшее время и ответит на все ваши вопросы.😊"""

from aiogram.types import User


class Text:
    strings = {
        "en": {
            "start": (
                "<b>Hi {}!</b>\n\n"
                "This bot will help you upload your files to "
                "telegraph and get links to them.\n\n"
                "<b>Upload your file:</b>\n"
                "<i>Only .jpg, .jpeg, .png, .gif and .mp4 files "
                "with a maximum size of 5 MB are allowed.</i>"
            ),
            "source": (
                "https://github.com/nessshon/telegraph-uploader-bot"
            ),
            "file_to_big_error": (
                "<b>File too big:{}</b>\n"
                "<i>The file size must not exceed 5 MB.</i>"
            ),
            "retry_after_error": (
                "<b>Flood control exceeded!</b>\n"
                "<i>Retry in {} seconds.</i>"
            ),
            "file_type_error": (
                "<b>Unsupported type!</b>\n"
                "<i>Allowed only .jpg, .jpeg, .png, .gif and .mp4 files.</i>"
            ),
            "another_error": (
                "<b>Unknown error!</b>\n"
                "<i>Try again later.</i>"
            ),
        },
        "ru": {
            "start": (
                "<b>Привет {}!</b>\n\n"
                "Этот бот поможет загрузить файлы в "
                "telegraph и получить на них ссылки.\n\n"
                "<b>Отправьте файл:</b>\n"
                "<i>Допускаются файлы .jpg, .jpeg, .png, .gif и .mp4 "
                "с максимальным размером 5 МБ.</i>"
            ),
            "source": (
                "https://github.com/nessshon/telegraph-uploader-bot"
            ),
            "file_to_big_error": (
                "<b>Файл слишком большой:{}</b>\n"
                "<i>Размер файла не должен превышать 5MB.</i>"
            ),
            "retry_after_error": (
                "<b>Превышено кол-во запросов!</b>\n"
                "<i>Повторите попытку через {} секунд.</i>"
            ),
            "file_type_error": (
                "<b>Неподдерживаемый тип!</b>\n"
                "<i>Разрешены только файлы .jpg, .jpeg, .png, .gif и .mp4.</i>"
            ),
            "another_error": (
                "<b>Неизвестная ошибка!</b>\n"
                "<i>Попробуйте повторить позже.</i>"
            )
        }
    }

    def __init__(self):
        language_code = User.get_current().language_code
        self.language_code = language_code if language_code == "ru" else "en"

    def get(self, key: str) -> str:
        return self.strings[self.language_code][key]